app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Biology"], ["room_number", 101], ["created_at", "2018-08-12 19:51:20.739672"], ["updated_at", "2018-08-12 19:51:20.739672"]]
---
  def create #uses strong parameters
    @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 102], ["updated_at", "2018-08-12 19:54:56.465818"], ["id", 2]]
---
  def update#uses strong parameters
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(params.require(:school_class).permit(:title, :room_number))