app/controllers/students_controller.rb

  def create #use strong parameters
    @student = Student.create(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Yung"], ["last_name", "Leung"], ["created_at", "2018-08-12 18:51:50.687391"], ["updated_at", "2018-08-12 18:51:50.687391"]]